public class Dictionary {

    private final static String[] words = {
            "Абрикос", "автомобили", "авиарейсы", "аквариум", "амфитеатр", "апельсин", "архивариус", "балетмейстер",
            "барометр", "библиотека", "биография", "бинокуляр", "благородство", "вдохновение",
            "великодушие", "веретено", "виноградарство", "водопад", "водоочистка", "воздушность", "воспоминание",
            "восхищение", "временность", "выкладывание", "высокомерие", "генеалогия", "гербарий", "гитарист",
            "головоломка", "государство", "грамматика", "двусмысленность", "двигатель", "декорация", "делегация",
            "деревообработка", "династия", "дисквалификация", "договорённость", "документация", "драматургия",
            "древесина", "дружелюбие", "живописец", "заключение", "занавеска", "затруднение", "зеркальность", "зоология",
            "идеология", "импровизация", "инженерство", "инновация", "инспекция", "инсталляция", "инструктаж",
            "интеграция", "интерпретация", "искусствоведение", "исследование", "историчность", "кабинет", "каменоломня",
            "кардиолог", "картофель", "коллекционер", "колонизация", "коммерсант", "конвертация",
            "конструктор", "контракт", "конфедерация", "кораблестроение", "корреспонденция", "креативность", "кулинария",
            "лаборатория", "легендарность", "летописец", "линкор", "любопытство", "магнитофон", "махинация", "механизм",
            "миролюбие", "миссионер", "моделирование", "мотоциклист", "наивность", "нанотехнология",
            "наставление", "настроение", "небоскрёб", "неоднозначность", "обезвоживание", "обоснование", "обработка",
            "образование", "общественность", "оздоровление", "оперативность", "оптимизация", "организация", "основание",
            "осуществление", "отзывчивость", "отчуждение", "панорама", "параллелизм", "паркет", "патриотизм", "перемещение",
            "перспектива", "пилотаж", "планирование", "подготовка", "полномочия", "поляризация", "посольство",
            "правильность", "превосходство", "презентация", "престиж", "преувеличение", "придаток", "призвание",
            "производство", "процесс", "публикация", "путешествие", "радиолокация", "результат", "реконструкция", "ремесленник",
            "секретность", "складирование", "солнечность", "спасение", "специализация", "стабилизация", "статистика",
            "супружество", "технология", "успокоение", "фантастика", "экспертиза"
    };

    public static String getWord(int numberWord) {
        return words[numberWord];
    }

    public static int getQuantityWords() {
        return words.length;
    }

}
